app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `jenis_daging`
SELECT *
FROM `jenis_daging`
SELECT COUNT(*) AS `numrows`
FROM `bb_masuk`
SELECT COUNT(*) AS `numrows`
FROM `bb_keluar`
SELECT SUM(`jumlah`) AS `jumlah`
FROM `bb_masuk`
WHERE `id_jenis_daging` = '2'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `bb_keluar`
WHERE `id_jenis_daging` = '2'
---
    public function index(): string
    {

        $daging = $this->dagingmodel->findAll();

        $data = [
            'menu' => 'dashboard',
            'page' => 'Dashboard',
            'subtitle' => 'Dashboard',
            'title' => 'Dashboard',
            'laporan_bulanan' => $this->laporan->ambilLaporan(),
            'jumlah_daging' => $this->dagingmodel->countAllResults(),
            'masuk' => $this->masukmodel->countAllResults(),
            'keluar' => $this->keluarmodel->countAllResults(),
            'stoks' => $this->stokmodel->countAllResults(),
            'jenis_daging' => $daging,
        ];

        // ini foreach untuk alert stok dalam gudang daging
        foreach ($daging as $jenis) {
            $total_masuk = $this->masukmodel->where('id_jenis_daging', $jenis['id'])->selectSum('jumlah')->get()->getRow()->jumlah;
            $total_keluar = $this->keluarmodel->where('id_jenis_daging', $jenis['id'])->selectSum('jumlah')->get()->getRow()->jumlah;