app/Controllers/KeluarController.php

UPDATE `bb_keluar` SET `id_jenis_daging` = '3', `jumlah` = '40', `tanggal` = '2023-08-08'
WHERE `bb_keluar`.`id` IN ('4')
UPDATE `info_daging_keluar` SET `id_jenis_daging` = '10', `jumlah` = '70', `tanggal` = '2023-06-01'
WHERE `info_daging_keluar`.`id` IN ('17')
---
    public function update($id)
    {
        $data = [
            'id' => $id,
            'id_jenis_daging' => $this->request->getVar('id_jenis_daging'),
            'jumlah' => $this->request->getVar('jumlah'),
            'tanggal' => $this->request->getVar('tanggal')
        ];

        $this->dagingkeluar->update($id, $data);