app/Models/KeluarModel.php

SELECT `bb_keluar`.*, `bahan_baku`.`bahan_baku`, `bahan_baku`.`nama_jenis`
FROM `bb_keluar`
JOIN `bahan_baku` ON `bahan_baku`.`id` = `bb_keluar`.`id_jenis_daging`
WHERE `bb_keluar`.`id` = '4'
---
    public function gabs_edit($id)
    {
        return $this->table('bb_keluar')
            ->select('bb_keluar.*, bahan_baku.bahan_baku, bahan_baku.nama_jenis')
            ->join('bahan_baku', 'bahan_baku.id = bb_keluar.id_jenis_daging')
            ->where('bb_keluar.id', $id)
            ->get()
            ->getrow();

SELECT *, `bb_keluar`.*, `bahan_baku`.`bahan_baku`, `bahan_baku`.`nama_jenis`
FROM `bb_keluar`
LEFT JOIN `bahan_baku` ON `bahan_baku`.`id` = `bb_keluar`.`id_jenis_daging`
---
    public function gabs_show()
    {
        $builder = $this->db->table($this->table);
        $builder->select('*');
        $builder->join('bahan_baku', 'bahan_baku.id = bb_keluar.id_jenis_daging', 'left');
        $builder->select('bb_keluar.*, bahan_baku.bahan_baku, bahan_baku.nama_jenis');

        $query = $builder->get();